---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileFlipAlong
source: html/01c6bd32-cdd9-2407-311c-3e510493c7a2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PartMakerSplitterProfileFlipAlong Property

"Profile Along Flip"

## Syntax (C#)
```csharp
public static ForgeTypeId PartMakerSplitterProfileFlipAlong { get; }
```